# running in formal/bullet/src/
read -formal bullet.v
read -formal timer_1us.v
read -formal clk_36MHz_generator.v
prep -top bullet

memory_nordff
async2sync
chformal -assume -early
chformal -live -fair -cover -remove
opt_clean
setundef -anyseq
opt -keepdc -fast
check
hierarchy -simcheck
write_ilang ../model/design.il
